"""Test Case For Khmer Camboja News"""
import requests
from scrapy.http import HtmlResponse
from url_khmer_scraping.jsonl_scraper.spiders.cambojanews import CambojaSpider

CambojaSpider = CambojaSpider()

def test_parse_data_cambojanews():
    """
    Test the parse_data method of CambojaSpider.

    Attributes:
    -------------
    article_url (str):
        URL of the article to be tested.
    article_response (HtmlResponse):
        The response object for the article URL.
    article_result (list):
        Parsed data from the article page.
    expected_value (dict):
        Expected result of the parsed data.

    Assertions:
        - The 'title' field of the parsed article is not empty.
        - The 'content' field of the parsed article is not empty.
        - The 'url' field of the parsed article is not empty.
    """
    expected_value = {
        "category": ["បរិស្ថាន", "ព័ត៌មានជាតិ", "ជនជាតិដើមភាគតិច​ពូនង", "ទំនប់វារីអគ្គិសនី​សេសានក្រោម ២", "ទំពួន", "ទាមទារ", "ទឹកជំនន់", "នេសាទ", "បណ្ណ​កម្មសិទ្ធិ​ដីសមូហភាព"],
        "title": "សហគមន៍ជនជាតិដើមភាគតិច​ពូនង​នៅ​ខេត្តស្ទឹងត្រែង ដែលរងផលប៉ះពាល់ពីទំនប់វារីអគ្គិសនី​សេសានក្រោម ២ នៅបន្តទាមទារបណ្ណកម្មសិទ្ធិ​ដីសមូហភាព", 
        "content": (
            "អស់រយៈពេលជាង ៧ឆ្នាំបន្ទាប់​ពី​ត្រូវបានបង្ខំចិត្ត​ចាកចោលផ្ទះសម្បែង​ដោយសារអាងទឹកដ៏ធំមួយនៃ​ទំនប់វារីអគ្គិសនី "
            "សហគមន៍ជនជាតិដើមភាគតិច​ពូនង​នៃខេត្តស្ទឹងត្រែង​ភាគខាងជើង​របស់​ប្រទេស​កម្ពុជា​នៅតែ​ប្ដេជ្ញាចិត្តក្រាញន"
            "នៀល​នៅលើ​ដីសេសសល់នៃភូមិកំណើតរបស់ពួកគេ​ដែលត្រូវទឹកជន់លិច​ ។ប្រជាពលរដ្ឋ​ ៦២គ្រួសារ​នៃភូមិ​ក្បាលរមាស​ចាស់​បាន​ប្ដេជ្ញាចិត្ត​រស់នៅជាបន្ត​នៅលើដីភូមិរបស់ពួកគេ បន្ទាប់ពី​ទឹកពីទំនប់​វារីអគ្គិសនី​សេសានក្រោម២បានជន់លិច​ផ្ទះសម្បែងរបស់ពួកគេ​កាលពីឆ្នាំ២០១៧ "
            "ដោយបង្ខំពួកគេ​ឱ្យចាកចេញទៅរកទីទួលជម្រក​បណ្ដោះអាសន្ន​ចម្ងាយប្រហែល ៥គីឡូម៉ែត្រ​នៅផ្នែក​ខាងលើ​អាង ។ ទំនប់វារីអគ្គិសនីដែល​មានសមត្ថភាព​ផលិតថាមពល ៤០០មេហ្គាវ៉ាត់ "
            "និង​ជាគម្រោង​វិនិយោគរួមគ្នារវាង​ក្រុមហ៊ុន​កម្ពុជា ចិន និងវៀតណាមក្នុង​ទឹកប្រាក់ ៨១៦​លានដុល្លារ បានធ្វើឱ្យតំបន់ជម្រាលទឹកភ្លៀង​ជនបទ​ផ្លាស់ប្ដូរ​លែងអាចដូចដើមវិញ "
            "ដែល​តំបន់ទាំងនេះ​ធ្លាប់ជាលំនៅប្រពៃណី​របស់​ជនជាតិដើមភាគតិច​ពូនង កួយ ឡាវ ចារ៉ាយ គ្រឹង និង​ទំពួន ។រដ្ឋាភិបាល​កម្ពុជា​បាន​ទទូច​ឱ្យ​ជនជាតិដើម​ភាគតិច​ពូនង​នៅ​ភូមិ​ក្បាលរមាស​ចាស់​ផ្លាស់លំនៅ​ទៅរស់នៅជាមួ"
            "យអម្បូររបស់ពួកគេ​នៅលើតំបន់តាំងលំនៅថ្មី ដែលមានចម្ងាយជាង ៥០គីឡូម៉ែត្រពី​ភូមិ​ចាស់របស់ពួកគេ ។ ប៉ុន្តែ "
            "ដោយសារតែ​ដំណើរការ​ស្នើសុំ​បណ្ណកម្មសិទ្ធិ​ដី​សមូហភាព​សម្រាប់ក្រុម​ជនជាតិ​ដើម​ភាគតិច​បានជាប់គាំង​អស់រយៈពេលជាច្រើន​ឆ្នាំ​ដោយសារ​ប្រទាំងប្រទើសនឹង​ផល​ប្រយោជន៍​របស់​ក្រុមហ៊ុន​កសិឧស្សាហកម្មមួយដែលនៅក្បែរខាងនោះ "
            "ក្រុមគ្រួសារដែលនៅក្រាញននៀល​អាចនឹង​ជាប់គាំងនៅក្នុងការតស៊ូ​របស់ពួកគេ​ដើម្បី​រក្សា​ដី​និង​កេរដំណែល​វប្បធម៌ ។ ប៉ុន្តែ នៅពេលនេះ បញ្ហា​មិនអាចបញ្ឈប់​ការតស៊ូរបស់ពួកគេ​បានទេ ។ដាំ សំណាង អាយុ ៣៩ឆ្នាំ បាននិយាយថា៖  "
            "ដោយលោកបានបន្ថែមថា៖ តាមការទទូចស្នើសុំ​របស់​រដ្ឋ គ្រួសារជនជាតិដើមភាគតិចពូនង​ប្រមាណ ៦៧​គ្រួសារ​បាន​ផ្លាស់លំនៅ​ទៅកាន់​ភូមិក្បាលរមាសថ្មី ។ ក្រុមមន្ត្រីបាន​ផ្ដល់​សំណង​ឱ្យ​គ្រួសារដែល​ផ្លាស់លំនៅ​នូវសំណង​ជា​ប្រាក់ "
            "៦០០០ដុល្លារជាថ្នូរនឹងទ្រព្យ​ដែលបាត់បង់ ជាមួយនឹងលទ្ធភាព​​ផ្ដល់​ប្រាក់សំណង​បន្ថែម​ដែលអាច​ឡើង​ដល់ ១០ ០០០ដុល្លារជាសរុប ។អ្នកស្រី ស្រាំង ឡាញ់ អាយុ ៤៧ឆ្នាំ មេភូមិឧបសម្ព័ន្ធភូមិ​ក្បាលរមាស "
            "និងជាប្រធានសហគមន៍​សម្រាប់​ដំណើរការ​ចុះបញ្ជីដីសមូហភាព បាននិយាយថា សំណងជាលុយគឺមិនគ្រប់គ្រាន់​ដើម្បី​ឱ្យ​គ្រួសារដែល​នៅក្រាញននៀល​បោះបង់​ដីប្រពៃណីរបស់ពួកគេ​ឡើយ ។​ ផ្ទុយទៅវិញ ពួកគេ​បានជំរុញ​​ទាមទារ​បណ្ណ​កម្មសិទ្ធិ​ដីសមូហភាព​ "
            "ជាជម្រើស​មួយ​ដែល​សហគមន៍ជនជាតិដើមភាគតិច​នៅកម្ពុជា​អាចធ្វើ​បានដើម្បី​ទទួលបាន​ភាពជាម្ចាស់កម្មសិទ្ធិ​លើ​ដី​សមូហភាពដែលទទួលស្គាល់ជាផ្លូវការ ។ ដីសមូហភាព​ជា​ដីដែលជនជាតិដើមភាគតិច​កាន់កាប់​តាមប្រពៃណី​ច្រើនជំនាន់​តកូនតចៅ​ជា​ទ្រព្យ​សមូហភាព​ "
            "និង​អាស្រ័យ​ផល​លើ​ដីនោះ​សម្រាប់​ការប្រមាញ់សត្វ ការចិញ្ចឹមសត្វពាហនៈ និង​ការធ្វើ​ស្រែចម្ការវិលជុំ ព្រមទាំង​សម្រាប់​គោលបំណង​សាសនា​និងវប្បធម៌​នានា ។​ក្រុមជនជាតិដើមភាគតិច​ពូនង​នៅកន្លែង​ផ្សេងទៀត​នៃបណ្ដាខេត្តភាគខាងជើងរបស់​កម្ពុជា​បាន​ទទួល​បណ្ណកម្មសិទ្ធិ​ដី​សមូហភាពរួចហើយ ប៉ុន្តែ ដំណើរការ​ចុះបញ្ជី​គឺវែងឆ្ងាយ​និងលំបាក​សម្រាប់​អ្នកភូមិ​ក្បាលរមាស ។ "
            "ក្រសួងមហាផ្ទៃបានទទួលស្គាល់ពួកគេជាផ្លូវការ​ថាជា​សហគមន៍ជនជាតិដើមភាគតិច​រួចហើយ​ ដែលនេះជាជំហានដ៏សំខាន់មួយ​នៅក្នុងដំណើរការ​ផ្ដល់​បណ្ណកម្មសិទ្ធិ​ដីសមូហភាព ប៉ុន្តែ "
            "ភាគច្រើននៃដី​ដែល​ពួកគេ​ស្វះស្វែង​ចុះបញ្ជី គឺជា​កម្មវត្ថុ​នៃការទាមទារប្រជែងគ្នា​ពីសំណាក់​ក្រុមហ៊ុន​មួយ​ឈ្មោះ Huayue Group ដែលពីមុនមានឈ្មោះថា Siv Guek Investment "
            "។ក្រុមហ៊ុន​ទទួលបាន​ការគាំទ្រ​ពីរដ្ឋាភិបាលស្រាប់តាមរយៈដីសម្បទានសេដ្ឋកិច្ច​ឆ្នាំ២០០៦ ដែល​ជាកម្មវិធីមួយ​របស់រដ្ឋាភិបាល​ដែល​ផ្ដល់​សម្បទានដីធ្លីធំៗ​សម្រាប់​ការអភិវឌ្ឍ​កសិកម្មទ្រង់ទ្រាយធំ "
            "។ កម្មវិធី​ដីសម្បទានសេដ្ឋកិច្ចនេះបានត្រូវផ្អាក​ចាប់ពីឆ្នាំ២០០៦មក ។ ក្រសួងកសិកម្ម​ រុក្ខាប្រមាញ់​ និង​នេសាទ​ បាន​ផ្ដល់ដីសម្បទាន ១០,០០០ហិកតា​ទៅ​ឱ្យ​ក្រុមហ៊ុន Siv Guek Investment ដើម្បី​បង្កើត​ជា​ចម្ការ​កៅស៊ូ ។ ក្រោយមក ក្រុមហ៊ុនពាណិជ្ជកម្មចិន ឈ្មោះ Huayue បានទិញយក​ក្រុមហ៊ុន Siv "
            "Guek និងបាន​កាន់កាប់​ដីសម្បទាននិងចម្ការកៅស៊ូ​ជាបន្ត ។ ក្រុមហ៊ុន​មិន​បាន​ឆ្លើយតបនឹងការ​ស្នើ​សុំ​អត្ថាធិប្បាយ​ពីអ្នកសារព័ត៌មានទេ ។ទំនប់​សេសានក្រោម ២ បាន​បង្កើត​ភាពចម្រូងចម្រាស​តាំងពីដំបូង​ទីមកម្ល៉េះ ""ដោយសារ​ផល​ប៉ះពាល់​សង្គម​និង​បរិស្ថាន​ធំធេងរបស់​ទំនប់ ។ ទំនប់នេះ​លាតសន្ធឹង​លើ​ទន្លេសេសាន រួមជាមួយនឹង​ទន្លេ​ស្រែពក និងទន្លេសេកុង ដោយបង្កើត​បានជាអ្វីមួយដែលអ្នកភូមិសាស្ត្រ​ហៅថា អនុអាងទន្លេ ៣ ស (សេសាន ស្រែពក និងសេកុង) ។ទីនេះជា​តំបន់ជម្រាលទឹកភ្លៀង​ដ៏សំខាន់មួយ​ដែល​ហូរចូលទៅក្នុង​ប្រព័ន្ធ​ទន្លេមេគង្គ ប៉ុន្តែ "
            "វាក៏​សំខាន់​ខ្លាំង​ចំពោះ​ប្រជាជន​ដែលរស់នៅតំបន់​នេះ​ផងដែរ ។ អ្នកអភិរក្ស​និយាយថា ការធ្វើទំនប់វារីអគ្គិសនី​​ទំហំ​ដ៏ធំនេះបាន​កាត់ផ្ដាច់​រំហូរ​ដីល្បាប់ ផ្លូវបម្លាស់ទីរបស់ត្រី "
            "និង​ដំណើរការ​ទន្លេសំខាន់ៗផ្សេងទៀត ដែល​ជួយទ្រទ្រង់​គ្រប់បែបសណ្ឋាននៃជីវិត ក្នុងនោះរាប់ទាំង​ប្រជាជន​រាប់លាននាក់ដែលរស់នៅ​តាម​សងខាងនៃច្រាំងទន្លេ​ផងដែរ ។ ចំពោះ​ក្រុម​ជនជាតិដើមភាគតិច​ ដូចជា​ សហគមន៍ពូនង​នៅ​ក្នុង​ភូមិ​ក្បាលរមាស "
            "ការថយចុះនូវធនធានធម្មជាតិដែលផ្ដល់​ដោយ​ទន្លេទាំងបី​បាន​ប៉ះពាល់​ខ្លាំង​មកលើ​ការរស់នៅរបស់ពួកគេតាំងពីមុន​ការបាត់បង់​ទ្រព្យសម្បត្តិនៅលើដីគោកម្ល៉េះ ។ពេលវេលា​កន្លង​ផុតទៅ​ជាច្រើនឆ្នាំ សហគមន៍​ភូមិ​ក្បាលរមាសចាស់​បាន​កាត់ចេញ​បន្តិចម្ដងៗ​នូវ​ទំហំ​ដីដែលស្នើសុំ​ចុះបញ្ជី​បណ្ណកម្មសិទ្ធិដីសមូហភាព ។ ពីដើមឡើយ សហគមន៍នេះបានស្វះស្វែង​ចុះបញ្ជី​ដីសមូហភាព​ទំហំ​ជាង ៧០០០ហិកតា ប៉ុន្តែ "
            "បានបន្ថយ​មក​នៅត្រឹម ៥០០០ហិកតានៅឆ្នាំ២០២០ នៅពេល​ប្រឈមមុខនឹងការជំទាស់ជាផ្លូវការ ។ មកដល់ឆ្នាំ២០២៣ ពួកគេបានកាត់ទំហំដីដែល​ស្នើសុំចុះបញ្ជីមកនៅត្រឹម ៣០០០ហិកតា ដែល​អ្នកស្រី ឡាញ់ និង​អ្នកភូមិផ្សេងទៀត​គិតថាជា​ផ្ទៃដីតូចបំផុត​ដែលត្រូវការចាំបាច់​សម្រាប់ការរស់នៅបែបប្រពៃណីរបស់សហគមន៍ជន"
            "ជាតិដើមភាគតិចរបស់ពួកខ្លួន ។អាជ្ញាធរខេត្តស្ទឹងត្រែងបានស្នើ​ផ្ដល់​ការដោះដូរ​ឱ្យសហគមន៍នៅឆ្នាំ២០២០ នូវ​ផ្ទៃដីទំហំ​ត្រឹមតែជាង ៩០០ហិកតា​នៅជុំវិញ​ទីតាំងភូមិក្បាលរមាសចាស់ ។ អ្នកស្រី ឡាញ់ បាននិយាយថា ការផ្ដល់នេះ​មិនអាច​ទទួលយកបានទេចំពោះគ្រួសារដែលសុខចិត្តនៅក្រាញននៀលនៅ​ផ្នែកខាងលើ​នៃ​អាង និងថា ចាប់តាំងពីពេលនោះមក ទោះបី​សហគមន៍​បានដាក់ពាក្យស្នើសុំ​ជាច្រើនលើក​ច្រើនសា​ទៅកាន់មន្ត្រីខេត្តក្ដី សំណើរបស់សហគមន៍​ពុំទទួលបាន​ការឆ្លើយតបទេ ។អ្នកស្រីត្អូញត្អែរថា៖ អ្នកស្រី យុន ម៉ាណេ ប្រធាន​អង្គការ​សង្គមស៊ីវិលមួយដែលមានឈ្មោះថា អង្គការ​ជនជាតិដើម​ភាគ​តិច​កម្ពុជា បាន​យល់ស្របថា ការកំណត់ត្រឹមតែ ៩០០ហិកតាអាចជា​បញ្ហា ដែលវា​ផ្ទុយនឹង​ទាំង​ក្របខណ្ឌ​ច្បាប់ជាតិ ទាំងក្របខណ្ឌច្បាប់អន្តរជាតិ ។អ្នកស្រី ម៉ាណេ "
            "ដែលរូបអ្នកស្រីផ្ទាល់​ជា​ជនជាតិដើម​ភាគតិច​ពូនង​មកពីខេត្ត​មណ្ឌលគិរី បាននិយាយថា៖  អ្នកស្រីបានបន្ថែមថា៖ ការផ្លាស់លំនៅរបស់​ជនជាតិដើមភាគតិចពូនង​ភាគច្រើនបំផុត​ចេញពីភូមិ​ក្បាលរមាស​ ដែល​​បណ្ដាលមកពី​ការបាត់បង់ទីជម្រក​ដោយសារ​អាងទំនប់ "
            "បានធ្វើ​ឱ្យ​ការខិតខំប្រឹងប្រែង​ដើម្បីទទួលបាន​បណ្ណកម្មសិទ្ធិលើ​ដីដែលនៅជុំវិញ​ភូមិចាស់​កាន់តែស្មុគស្មាញថែមទៀត ។លោក គ្រី សុឡានី ប្រធានកម្មវិធី​របស់អង្គការ​ភូមិខ្ញុំប្រចាំខេត្តស្ទឹងត្រែង ដែលជា​អង្គការ​មិនមែនរដ្ឋាភិបាល​ បាននិយាយថា "
            "អង្គការរបស់​លោក​បាន​ចាប់ផ្ដើមធ្វើការងារ​ដើម្បី​រៀបចំ​ឯកសារ​ចុះបញ្ជី​ស្នើសុំ​បណ្ណកម្មសិទ្ធិដីធ្លី​ជាមួយ​សហគមន៍ភូមិ​ក្បាលរមាស តាំងពីដើម​ឆ្នាំ​២០១០មកម្ល៉េះ ។ ប៉ុន្តែ លោក សុឡានី បាននិយាយថា នៅពេលដែល​ការអភិវឌ្ឍ​ចាប់ផ្ដើម​ឡើង​សម្រាប់​គម្រោង​ទំនប់​វារីអគ្គិសនី​សេសាន​ក្រោម២ "
            "យោងតាម​ច្បាប់​ភូមិបាល​កម្ពុជាត្រង់ចំណុចស្ដីពី​អចលនវត្ថុ​របស់​សហគមន៍ជនជាតិ​ដើមភាគតិច ដីដែលពាក់ព័ន្ធនឹងសហគមន៍ដែលបានលើកឡើង គឺជាកន្លែងដែលសហគមន៍ជនជាតិភាគតិច​បាន​សង់លំនៅឋាន​និង​កន្លែងដែលពួកគេ​ប្រកប​របរ​កសិកម្ម​បែបប្រពៃណី ។ "
            "ទោះបី​ភូមិ​ក្បាលរមាសចាស់​ស្ថិតក្រោម​លក្ខណវិនិច្ឆ័យនេះក្ដី អ្នកភូមិដែលនៅក្រាញននៀលនៅលើដី​ដែលស្ថិតនៅផ្នែកខាងលើ​បន្តិច​នៃ​តំបន់អាងទឹកមិនត្រូវបានទទួលស្គាល់ជាភូមិ​ផ្លូវការ​នៅឡើយទេ បើទោះបី​អាជ្ញាធរ​ខេត្ត​បាន​អនុញ្ញាត​ឱ្យពួកគេ​រស់នៅទីនោះ​បន្ត​ក៏ដោយ "
            "។អ្នកនាំពាក្យ​សាលាខេត្ត​ស្ទឹងត្រែង​ លោក ម៉ែន គុង បាននិយាយថា ក្រុម​មន្ត្រីបានគាំទ្រ​ការខិតខំ​របស់​សហគមន៍ជនជាតិដើមភាគតិចពូនង​ដើម្បី​ទទួលបាន​បណ្ណកម្មសិទ្ធិ​ដីសមូហភាព ប៉ុន្តែ លោកបាននិយាយថា ឧបសគ្គចម្បងបំផុតគឺការត្រួតស៊ីគ្នាជាមួយនឹង​ដីសម្បទានសេដ្ឋកិច្ច​ដែលរដ្ឋបានប្រគល់​ឱ្យទៅ​ក្រុមហ៊ុន Siv Guek ។លោក គុង បាននិយាយថា "
            "ក្រុម​ការងារខេត្ត​មកពី​កម្រិតជាច្រើន​របស់រដ្ឋាភិបាល​បាន​មកទស្សនកិច្ច​សហគមន៍​ដើម្បី​ដោះស្រាយបញ្ហានេះ ប៉ុន្តែ នៅទីបញ្ចប់ «ពុំទាន់មានការសម្រួលណាមួយនៅឡើយទេ រវាង​ក្រុមហ៊ុន​និង​សហគមន៍» ថាតើ​ត្រូវ​សម្រុះសម្រួលគ្នា​យ៉ាងដូចម្ដេច ។លោកបាននិយាយថា៖  លោកបានបន្តថា៖ ស្របពេលជាមួយគ្នានេះ ដោយសារតែ​ពុំទាន់មានសិទ្ធិស្របច្បាប់ដើម្បីកាន់កាប់ដីសមូហភាព​​នៅឡើយ​ "
            "សហគមន៍ដែល​នៅក្រាញននៀល​មិនព្រមចាកចេញពី​ភូមិ​ក្បាលរមាសចាស់ កំពុងរស់នៅ​ក្នុងស្ថានភាព​មួយដែលងាយនឹងរងគ្រោះ ។ ឥឡូវនេះ គ្រួសារខ្លះបានសង់ផ្ទះថ្មី​ និង​ប្រឹងប្រែងរស់​តាម​លទ្ធភាពដែលអាចធ្វើទៅបាន ប៉ុន្តែ ប្រជាពលរដ្ឋ​មួយចំនួន​ត្អូញត្អែរថា "
            "ពួកគេ​​មិនទទួលបាន​​អគ្គិសនី​​ពី​ទំនប់​ដែល​ធ្វើ​ឱ្យពួកគេបាត់បង់​ផ្ទះសម្បែង​ផងទេ ដោយពួកគេ​ពឹងផ្អែក​លើ​បន្ទះថាមពល​ពន្លឺ​ព្រះអាទិត្យ​ (បន្ទះសូឡា) ដើម្បី​បំភ្លឺផ្ទះសម្បែងរបស់ពួកគេ​ ។កាន់តែលំបាកជាងនេះទៀត អ្នកភូមិ​និយាយថា "
            "ស្ថានភាព​មិនទាន់ដោះស្រាយដាច់ស្រេចរបស់ពួកគេ​អាចនឹងនាំឱ្យពួកគេ​ប្រឈមនឹងការទន្ទ្រានយកដី​របស់ពួកគេ​ពីសំណាក់​ជន​ដែល​កំពុងចូលកាន់កាប់​ដី​ដូនតារបស់ពួកគេ ។ សហគមន៍និយាយថា រឿងនេះបានកើតឡើងរួច​ហើយ​កាលពីពេលកន្លងមក ដោយ​អះអាងថា ក្រុមហ៊ុន Huayue "
            "បាន​ឈូសឆាយ​ទន្រ្ទាន​យក​ដី​ដែល​សំខាន់​ចំពោះ​ការប្រណិប័តន៍​​វប្បធម៌​និងទំនៀមទម្លាប់ប្រពៃណីរបស់សហគមន៍ ។ប្រ៊ច់ រិទ្ធី អាយុ​ ២៩ឆ្នាំ គឺជា​ប្រធានស្ដីទី​នៃ​ក្រុមការងារ​ចុះល្បាត​ព្រៃឈើ​និង​ជលផល​សហគមន៍​ ។ "
            "លោក រិទ្ធី បាននិយាយថា លោក​តែងតែចង់​ការពារ​ធនធានធម្មជាតិ​យ៉ាងខ្លាំង ។ លោក​និយាយថា៖ រិទ្ធី បានសំណូមពរ​ទៅ​កាន់​មន្ត្រីពាក់ព័ន្ធ​បន្ត​សហការ​ជាមួយសហគមន៍​ដើម្បី​ពន្លឿន​ដំណើរការ​ចុះបញ្ជី​បណ្ណកម្មសិទ្ធិ​ដីសមូហភាព "
            "ដើម្បី​កុំ​ឱ្យ​សហគមន៍ជនជាតិដើមភាគតិចពូនង​ភូមិ​ក្បាលរមាសចាស់​ប្រឈមមុខនឹង​ការ​បណ្ដេញ​ចេញ​នាពេលអនាគត ។ រិទ្ធី បាន​និយាយ​យ៉ាងដូច្នេះថា៖  លោកបានបន្ថែមថា៖  ៕ប្រែសម្រួលពីអត្ថបទភាសាអង់គ្លេស៖ "
        )
        }

    article_url = "https://khmer.cambojanews.com/stung-treng-bunong-community-fights-for-collective-land-title-years-after-deluge-of-lower-sesan-ii-dam/"
    article = requests.get(article_url)
    article_response = HtmlResponse(url=article.url, body=article.text, encoding="utf-8")


    article = next(CambojaSpider.parse_data(article_response))
    assert article["category"] == expected_value["category"]
    assert article["title"] == expected_value["title"]
    assert article["content"] == expected_value["content"]
    assert article["url"] == article_url

def test_parse_cambojanews():
    """
    Test the parse method of CambojaSpider.

    Attributes:
    ------------
    category_url (str): 
        URL of the category page to be tested.
    category_response (HtmlResponse):
        The response object for the category URL.
    category_result (list):
        Parsed data from the category page.
    links (list):
        List of article links extracted from the category page.
    next_page (list):
        URL segments for constructing the next page URL.
    next_page_url (str):
        Constructed URL for the next page.

    Assertions:
        - The number of article links (excluding the next page link) is 9.
        - The 10th link is the URL for the next page.
        - The next page URL matches the expected URL.
    """

    category_url = "https://khmer.cambojanews.com/category/journalists/"
    category = requests.get(category_url)
    category_response = HtmlResponse(url=category.url, body=category.text, encoding="utf-8")
    category_result = CambojaSpider.parse(category_response)

    """
    testing the parsing category 
    """
    links = []
    for link in category_result:
        links.append(link.url)
    
    """
    Test for pagination
    """
    next_page = category_response.url.rstrip("/").split("/")

    if next_page[-1].isdigit():
        next_page[-1] = str(int(next_page[-1]) + 1)
    else:
        next_page.append("page/2")
    
    next_page_url = "/".join(next_page)

    assert len(links) - 1 == 9
    assert links[9] == next_page_url
    assert links[9] == "https://khmer.cambojanews.com/category/journalists/page/2"
