"""Test Case For Focus-Cambodia Website"""
import requests
from scrapy.http import HtmlResponse
from url_khmer_scraping.jsonl_scraper.spiders.focuscambodia import FocuscambodiaSpider

focuscambodia_spider = FocuscambodiaSpider()

def test_parse_with_num_focuscambodia():
    """
    Test of `parse` method of the `FocuscambodiaSpider`.
    
    This test checks the following:
    - The title of the article is not empty.
    - The content of the article is not an empty dictionary.
    - The URL of the article is not an empty dictionary.

    Attributes:
    ----------
    category_url (str):
        The URL of the category page to be tested.
    category (Response):
        The HTTP response object for the category URL.
    category_response (HtmlResponse):
        The response object to be passed to the spider's `parse` method.
    category_result (list):
        The result returned by the spider's `parse` method.
    links (list):
        A list of URLs extracted from the category page.
    next_page (str):
        The URL of the next page after pagination.
    """
    category_url = "https://focus-cambodia.com/km/អាជីព/2"
    category = requests.get(category_url)
    category_response = HtmlResponse(url=category.url, body=category.text, encoding="utf-8")
    category_result = focuscambodia_spider.parse(category_response)

    """
    testing the parsing category 
    """
    links = []
    for link in category_result:
        links.append(link.url)
    
    """
    Test for pagination
    """
    current_url = category_response.url.rstrip("/").split("/")
    if current_url[-1].isdigit():
        current_url[-1] = str(int(current_url[-1]) + 1)
    else:
        current_url.append("/2")
    next_page_url = "/".join(current_url)
    
    assert len(links) - 1 == 4
    assert links[4] == next_page_url
    assert links[4] == "https://focus-cambodia.com/km/%e1%9e%a2%e1%9e%b6%e1%9e%87%e1%9e%b8%e1%9e%96/3"

def test_parse_without_num_focuscambodia():
    """
    Test of `parse` method of the `FocuscambodiaSpider`.
    
    This test checks the following:
    - The title of the article is not empty.
    - The content of the article is not an empty dictionary.
    - The URL of the article is not an empty dictionary.

    Attributes:
    ----------
    category_url (str):
        The URL of the category page to be tested.
    category (Response):
        The HTTP response object for the category URL.
    category_response (HtmlResponse):
        The response object to be passed to the spider's `parse` method.
    category_result (list):
        The result returned by the spider's `parse` method.
    links (list):
        A list of URLs extracted from the category page.
    next_page (str):
        The URL of the next page after pagination.
    """
    category_url = "https://focus-cambodia.com/km/អាជីព/"
    category = requests.get(category_url)
    category_response = HtmlResponse(url=category.url, body=category.text, encoding="utf-8")
    category_result = focuscambodia_spider.parse(category_response)

    """
    testing the parsing category 
    """
    links = []
    for link in category_result:
        links.append(link.url)
    
    """
    Test for pagination
    """
    current_url = category_response.url.rstrip("/").split("/")
    if current_url[-1].isdigit():
        current_url[-1] = str(int(current_url[-1]) + 1)
    else:
        current_url.append("/2")
    next_page_url = "/".join(current_url)
    
    assert len(links) - 1 == 4
    assert links[4] == next_page_url
    assert links[4] == "https://focus-cambodia.com/km/%E1%9E%A2%E1%9E%B6%E1%9E%87%E1%9E%B8%E1%9E%96//2"

def test_parse_data_focuscambodia():
    """
    This function is used to test the parse data method of `FocuscambodiaSpider`.
    This checks to see if the filtering works correctly.
    This test is conducted using live data from the website.

    Note: The filtering mainly focuses on the URL.

    Attribute
    ---------
    article_response:
        live response generated from article url
    article_result:
        list of article urls generated from article response
    article: dict
        desired output (should be parsed)
    expected_value (dict):
        Expected result of the parsed data.
    """
    expected_value = {
        "category": "អាជីព,self-employed,ទំនោរការងារ,សហគ្រិនភាព",
        "title": "យុវជនជំនាន់ថ្មី និងទំនោរការងារបច្ចុប្បន្ន",
        "content": ("សម្រាប់​យុវជន​ជំនាន់​ថ្មី ចំណុច​ដែល​ទាក់ទាញ​ក្នុង​ការ​ប្រឡូក​ក្នុង​វិស័យ​ការងារ "
                    "មិនបាន​ផ្តោត​សំខាន់​ទៅលើ​ប្រាក់បៀវត្ស​ន៍​ល្អ​មួយ​មុខ​នោះ​ទេ។ ការ​អភិវឌ្ឍ​សមត្ថភាព "
                    "ឯករាជ្យ​ភាព សេរីភាព ការ​ផ្តល់​តម្លៃ​ឱ្យ​គ្នា​ទៅវិញទៅមក​ក្នុង​ក្រុមការងារ ជាពិសេស​បទពិសោធន៍ "
                    "ដែល​អាច​នឹង​ជួយ​សម្រេច​បានអ្វី​មួយ​ជា​របស់​ខ្លួនឯង​នៅ​ថ្ងៃ​អនាគត ជា​ការងារ​ដែល​ពួក​គេ​កំពុង​ស្វែងរក។\t\t\tWritten By: Focus team\n\t\t\n\nរូបភាពដោយ តូច "
                    "ធីណា\n\n\n\n\n\n\n\nប្រជាជន​ខ្មែរ​ធ្លាប់​មាន​ទស្សនៈ​ថា ការបម្រើ​ការងារ​ជូន​រដ្ឋ​ដែល​មាន​ភាព​អចិន្ត្រៃយ៍ និង​ប្រាក់​ចូលនិវត្តន៍ "
                    "ជា​អ្វី​ដែល​មនុស្ស​ទូទៅ​តែងតែ​ពិចារណា និង​ឱ្យ​តម្លៃ។ នៅពេល​និយាយ​ពី​ផ្នត់គំនិត​ធ្វើជំនួញទាល់តែ​ជាប់​ខ្សែស្រឡាយ​ចិន គឺ​ទើប​ពូកែ​រក​សុី និង​ឈ្លាសវៃ។ ហើយ​អ្នក​មិន​គួរ​ចាប់ផ្តើម​រក​រក​សុី ឬវិនិយោគ​ទៅលើ​អ្វីមួយ "
                    "នៅ​វ័យក្មេង​ពេក​នោះ​ទេ។ តើ​ទស្សនៈ​អាច​មានការ​ផ្លាស់​ប្តូរ​ដែរ​ឬទេ ក្នុងចំណោម​យុវជន​ខ្មែរ​ជំនាន់​ថ្មី និង​ស្ថានភាព​សង្គម​ការងារ​នា​ពេល​បច្ចុប្បន្ន?\n\n\n\nយោង​តាម​របាយការណ៍​របស់ អង្គការ​អន្តរជាតិ​ខាង​ការងារ (ILO) "
                    "ដែល​បាន​ចុះផ្សាយ​កាលពី​ចុងឆ្នាំ២០២០ បាន​បង្ហាញថា យុវជន​ខ្មែរ​ប្រមាណ ១.៨០០ នាក់​បាន​ចូលរួម​ក្នុង​ទិវា​សហគ្រិនភាព​កម្ពុជា (CED ២០២០) ដែល​ធ្វើឡើង​តាមរយៈ​អន​ឡាញ។ "
                    "ក្នុងចំណោម​អ្នកចូលរួម មាន៧៣ភាគរយ មាន​អាយុ​ចាប់ពី១៦ដល់២០ឆ្នាំ ហើយ​ជាង ៧០ ភាគរយ​នៃ​អ្នកចូលរួម​ក្នុង​ឆ្នាំនេះ បាន​បង្ហាញ​ការចាប់អារម្មណ៍​ខ្លាំង ក្នុង​ការ​ចាប់ផ្តើម "
                    "អាជីវកម្ម​ផ្ទាល់ខ្លួន។\n\n\n\nយោង​តាម​របាយការណ៍​របស់ អង្គការ​អន្តរជាតិ​ខាង​ការងារ (ILO) ដែល​បាន​ចុះផ្សាយ​កាលពី​ចុងឆ្នាំ២០២០ បាន​បង្ហាញថា យុវជន​ខ្មែរ​ប្រមាណ ១.៨០០ នាក់​បាន​ចូលរួម​ក្នុង​ទិវា​សហគ្រិនភាព​កម្ពុជា (CED ២០២០) ដែល​ធ្វើឡើង​តាមរយៈ​អន​ឡាញ។ "
                    "ក្នុងចំណោម​អ្នកចូលរួម មាន៧៣ភាគរយ មាន​អាយុ​ចាប់ពី១៦ដល់២០ឆ្នាំ ហើយ​ជាង ៧០ ភាគរយ​នៃ​អ្នកចូលរួម​ក្នុង​ឆ្នាំនេះ បាន​បង្ហាញ​ការចាប់អារម្មណ៍​ខ្លាំង ក្នុង​ការ​ចាប់ផ្តើម "
                    "អាជីវកម្ម​ផ្ទាល់ខ្លួន។\n\n\n\nADVERTISEMENT\n\n\n\nកញ្ញា លាង ឡា​ណា ជា​បុគ្គលិក​បម្រើ​ធនាគារឯកជន​ម្នាក់ ដោយ​បម្រើការ​ងារ​អស់​រយៈពេល​ជាង៤ឆ្នាំ​រួចមក​ហើយ។ កញ្ញា​បាន​បង្ហាញ​ពី​ចំណាប់​អារម្មណ៍​ផ្ទាល់ខ្លួន ទៅលើ​ជីវិត​ការងារ​ប្រចាំថ្ងៃ​របស់​ខ្លួន​ថា៖ "
                    "« ពី​ដំបូង​ខ្ញុំ​ចូលចិត្ត​ការងារ​របស់ខ្ញុំ ព្រោះ​វា​បាន​បង្រៀន​ខ្ញុំ​ទាំង hard skill និង soft skill។ ប៉ុន្តែ​ឥលូវ​នេះ ខ្ញុំ​ចាប់ផ្តើម​មាន​អារម្មណ៍​ថា​ធុញ ព្រោះ​ត្រូវ​ធ្វើការ​ងារ​ដដែលៗរាល់ថ្ងៃ ហើយ​មិន​មាន​អ្វី​ថ្មី "
                    "ដែល​អាច​ជួយ​ឱ្យ​ខ្ញុំ​រីកចម្រើន​ទៅមុខ​ទៀត»។\n\n\n\nមន្រ្តី​ប្រតិបត្តិ​ការ​ពាណិជ្ជកម្ម​ជាន់ខ្ពស់​រូប​នេះ យល់ថា​ដើម្បី​សម្រេច​បាន​នូវ​ការងារ​ដ៏​ជោគជ័យ​មួយ នៅក្នុង​ជីវិត​ការងារ​របស់​ខ្លួន គឺ​ខ្លួន​ត្រូវ​បន្ត​ស្វែងរក​នូវ​ចំណេះដឹង "
                    "និង​ពង្រឹង​សមត្ថភាព​បន្ថែម​ទៀត មុននឹង​សម្រេច​ចាប់​យក អាជីវកម្ម​ណាមួយ​បន្ថែម​ទៀត នៅ​ថ្ងៃខាងមុខ។ ការបម្រើ​ការ នៅក្នុង​វិស័យ​ឯកជន​តែមួយមុខ​នេះ "
                    "មិន​អាច​ជួយ​ខ្លួនឯង​សម្រេច​គោលដៅ​នោះ​ឡើយ ។\n\n\n\nមន្ត្រី​វ័យ២៥ឆ្នាំនេះ បាន​និយាយ​ថា« ខ្ញុំ​ចង់​រក​ការងារ​បន្ថែម​ពី​ការងារ​នេះ "
                    "ឬបង្កើត​មុខរបរ​អ្វីមួយ​សម្រាប់​ខ្លួនឯង​នៅ​ថ្ងៃខាងមុខ ព្រោះ​មិនបាច់​ត្រូវ​ធ្វើការ​នៅ​ក្រោម​សម្ពាធ​ការងារ​ពី​គេ ហើយ​ខ្ញុំ​ចង់​ធ្វើអ្វី​ដែល​ថ្មីៗ "
                    "ដែល​ជួយ​ឱ្យ​ខ្ញុំ​រីកចម្រើន និង​ប្រាក់ចំណូល​សមរម្យ​តាម​សមត្ថភាព​របស់​ខ្លួន។»\n\n\n\nទាក់ទង​នឹង​គម្រោងការ​ផ្លាស់​ប្តូរ​មុខរបរ​នេះ កញ្ញា លាង ឡា​ណា ក៏បាន​គិតពិចារណា​ពី​គុណសម្បត្តិ និង​គុណវិបត្តិ​ដូចគ្នា "
                    "ព្រោះ​មាន​បញ្ហា​ប្រឈម​ជាច្រើន​ទៀត ដែល​ត្រូវ​ស្វែងយល់​បន្ថែម ក្នុង​ការ​ផ្លាស់​ប្តូរ​ការងារ​ពី​វិស័យ​មួយ ទៅ​វិស័យ​មួយទៀត ដែល​ខុសពី​គ្នា​ស្ទើរតែ​ទាំងស្រុង ហើយ​ទំនួល​ខុសត្រូវ​អាច​នឹង​ធំជាង​មុន។ ប៉ុន្តែ​គាត់​យល់ឃើញ​ថា វា​ជា​អ្វី​ដែល​ខ្លួន "
                    "គួរតែ​ហ៊ាន​សាកល្បង នៅក្នុង​ជីវិត​ការងារ រួម​ទាំង​ទទួលយក​ការ​បរាជ័យ​ផង​ដែរ។\n\n\n\nគាត់​បាន​និយាយ​ថា « ការ​ប្តូរ​មុខរបរ​ពី​ការ​ធ្វើការ​ឱ្យ​គេ មករ​កសុី​ដោយខ្លួនឯង​វិញ ជា​រឿង​លំបាក "
                    "ប៉ុន្តែ​ខ្ញុំ​ជា​មនុស្ស​ដែល​ចូលចិត្ត​គិត​អី ទៅមុខ​ឱ្យ​ហើយ ចឹង​ទោះបីជា​វាប​រា​ជ័យ ខ្ញុំ​គិតថា​យ៉ាងណាក៏បាន​ព្យាយាម​ហើយ ប៉ុន្តែ​បើ​យើង​មិនបាន​ព្យាយាម "
                    "ទើប​ជា​ការ​បរាជ័យ​មួយ​ដ៏​ធំ​សម្រាប់​ខ្ញុំ។»\n\n\n\nជីវិត​ការងារ​ក្នុង​ក្តី​ស្រ​ម៉ៃ របស់​កញ្ញា ឡា​ណា "
                    "គឺជា​ការងារ​ដែល​អាច​ជួយ​ឱ្យ​ខ្លួន​មាន​សេរីភាព​ក្នុង​ការសម្រេច​ចិត្ត​អភិ​វឌ្ឍសមត្ថភាព​ខ្លួនឯង និង​អ្នក​ជុំវិញ​ខ្លួន ហើយ​ជាពិសេស មាន​ពេលវេលា​គ្រប់គ្រាន់​សម្រាប់​ខ្លួនឯង "
                    "និង​ក្រុម​គ្រួសារ​គ្រួសារ ដោយ​មិន​ផ្តោត​សំខាន់​ខ្លាំង​ទៅលើ​ប្រាក់ចំណូល​ធំ​តែមួយមុខ​គត់​នោះ​ទេ។\n\n\n\nតើ​នេះ​គ្រាន់តែ​"
                    "ជា​ការយល់ឃើញ​ពី​ជ្រុង​មួយ​របស់​យុវវ័យ ឬជារ​បត់​ការងារ​សម្រាប់​មនុស្ស​ជំនាន់​ថ្មី?\n\n\n\nបើ​យើង​ក្រឡេក​ទៅ​មើល​ប្រមាណ​ត្រឹមតែ​មួយ​ទសវត្ស​ន៍​មុន សម្រាប់​យុវជន​ខ្មែរ ការបង្កើត​មុខរបរ​រក​សុី​ដោយខ្លួនឯង ការលក់ដូរ​ទំនិញ​តាម​អន​ឡាញ "
                    "និង​ការ​ធ្វើការងារ​ជា​លក្ខណៈ​ឯករាជ្យ (freelance) នៅ​មិនទាន់​មានការ​ពេញនិយម ប៉ុន្តែ​បច្ចុប្បន្ន​មានការ​កើនឡើង​ជាង​មុន។\n\n\n\n«វិស័យ​ពាណិជ្ជកម្ម​តាម​ប្រព័ន្ធ​អេឡិចត្រូនិក​របស់​ប្រទេស​កម្ពុជា មានការ​រីកចម្រើន​យ៉ាង​ឆាប់រហ័ស ក្នុងរយៈពេល​មួយ​ទសវត្សរ៍​ចុងក្រោយ​នេះ "
                    "ដោយសារ​ការប្រើ​ប្រាស់​អុីន​ធឺ​ណិ​ត មាន​ភាព​ងាយស្រួល​ជាង​មុន និង​មានតម្លៃ​សមរម្យ»។ នេះ​បើ​ការ​លើកឡើង​របស់​ឯកឧត្តម ប៉ាន សូរ​ស័ក្តិ រដ្ឋមន្រ្តី​ក្រសួង​ពាណិជ្ជកម្ម ដែល​បាន​ចុះផ្សាយ​នៅក្នុង​ការសិក្សា​មួយ​របស់​សន្និសីទ​អង្គការសហប្រជាជាតិ "
                    "ស្តី​ពី​ពាណិជ្ជកម្ម​និង​ការអភិវឌ្ឍន៍ (UNCTAD) ស្តី​ពី​បង្កើត​អាជីវកម្ម​តាម​ប្រព័ន្ធ​អេ​ឡិច​ត្រូ​និច​នៅ​កម្ពុជា ែ​ដលបាន​ចុះផ្សាយ​កាលពី​ឆ្នាំ២០២០កន្លងមក​នេះ។\n\n\n\nការសិក្សា​ជាច្រើន​ទៀត "
                    "ក៏បាន​បង្ហាញ​ផង​ដែរ​ថា មូលហេតុ​ដែល​អាច​ធ្វើ​ឱ្យ​បរិបទ​មនុស្ស​ចំពោះ​ការងារ​មានការ​ផ្លាស់​ប្តូរ ""អាច​បណ្តាល​មក​ពីក​ត្តា​ផ្សេងៗដូចជា កត្តា​បច្ចេកវិទ្យា​ដែល​ធ្វើ​ឱ្យ​មាន​ភាព​ស្រួល​ជាង​មុន​ក្នុង​ការ​ធ្វើការ ហើយ​ងាក​មក​ចង់​ធ្វើអ្វី​ទាក់ទង​នឹង​ការប្រើ​ប្រាស់​ការ​គិត "
                    "និង​ភាព​ច្នៃប្រឌិត​កត្តា​រីក​លូតលាស់​នៃ​សេដ្ឋកិច្ច និង​កត្តា​ចិត្តសាស្ត្រ​របស់​មនុស្ស ដែល​មានការ​ផ្លាស់​ប្តូរ​ដោយសារ​បរិយាកាស​កន្លែង​ការងារ សុខភាព​ផ្លូវកាយ​និង​ផ្លូវចិត្ត "
                    "និង​ការ​រំពឹង​ទុកជា​ដើម។\n\n\n\n​​បើ​ផ្អែក​ទៅលើ​ការសិក្សា​របស់​លោកស្រី Cherlyn Cran ជា​សហគ្រិន និង​ជា​អ្នកនិពន្ធ​សៀវភៅ​ជនជាតិ​កាណាដា​ដ៏​ល្បី​មួយ​រូប បាន​រក​ឃើញថា "
                    "ក្រុម​មនុស្ស​ដែល​កើត​ជំនាន់ Y (១៩៨១-១៩៩៦) និង ជំនាន់ Z (១៩៩៧-២០១២)នេះ ភាគច្រើន​ចូលចិត្ត​ធ្វើការងារ​ដែល​ទាក់ទង​នឹង​ភាព​ច្នៃប្រឌិត អាច​ជួយ​ដោះស្រាយ​បញ្ហា​ពិភពលោក "
                    "ហើយ​មានឱកាស​អាច​ប្រើ​ជំនាញ​ពិសេស​របស់​ខ្លួន។\n\n\n\nទស្សនៈ​របស់​ក្រុម​មនុស្ស​ជំនាន់​ទាំងនេះ ច្រើន​យល់ថា​ការស្វែងរក​ការងារ​ណា ដែល​មាន​អ្នកដឹកនាំ​ល្អ ហើយ​អាច​ជួយ​បំផុស​គំ​និ​តថ្មីៗ និង​ចែករំលែក​ចំណេះដឹង ក្នុង​ការ​ជួយ​ឱ្យ​ខ្លួន​បាន​រីកចម្រើនក្នុង​អាជីព​នៅ​ថ្ងៃខាងមុខ "
                    "គឺជា​ចំណុច​សំខាន់។\n\n\n\nយោង​តាម​ទិន្នន័យ​របស់​ធនាគារពិភពលោក កាល​ពី​ថ្មីៗកន្លងមក​នេះ បាន​បង្ហាញថា ៣០% នៃ​ចំនួន​ប្រជាជន​ពិភពលោក កំពុងធ្វើការ​រក​សុី​ដោយខ្លួនឯង (self-employed)។ "
                    "ហើយ​តួលេខ​នេះ នឹង​កាន់តែ​កើនឡើង​ខ្លាំង នា​ពេល​អនាគត ជាពិសេស​នៅពេល​ក្រុម​មនុស្ស​ដែល​កើត​ជំនាន់Y ជាច្រើន​បាន​ចាកចេញ​ពី​មហាវិទ្យាល័យ ដើម្បី​ចូលក្នុង​ទីផ្សារ​ការងារ។ស្រប​ពេលនេះ​ដែរ អ្នកខ្លះ​ទៀត​បាន​ចាប់ផ្តើម​បោះបង់​ការងារ "
                    "ហើយ​ងាក​មក​បង្កើត​ការងារ ឬមុខរបរ​អ្វីមួយ​សម្រាប់​ខ្លួនឯង។ ការសិក្សា​ដដែល​នេះ ក៏បាន​លើកឡើង​ផង​ដែរ​ថា ក្រុម​មនុស្ស​ដែល​កើត​ជំនាន់Yនេះ មិនសូវ​ចង់​ធ្វើការ​ឱ្យ​អ្នកដទៃ​លើស​ពី​បី​ឆ្នាំ​នោះ​ទេ។\n\n\n\nរូបភាពដោយ តូច ធីណា\n\n\n\nតើ​ទំនោរ​នេះ អាច​នាំមក​នូវ​គុណសម្បត្តិ និង​គុណវិបត្តិ​អ្វីខ្លះ?\n\n\n\nទាក់ទិន​នឹង​ការ​ផ្លាស់​ប្តូរ​នេះ កញ្ញា សា​រឿន លក្ខណា ជា​ប្រធាន​គម្រោង "
                    "នៃ​សហគ្រាស​សង្គម She Investment ដែល​បង្កើត​ឡើង​នៅ​ឆ្នាំ២០១៤ ដើម្បី​ផ្តល់​ជូន​នូវ​កម្មវិធី​ជំនួយ​គាំទ្រ​និង​ពន្លឿនអាជីវកម្ម​សម្រាប់​ស្ត្រី​នៅ​កម្ពុជា បាន​ចែករំលែក​តាម​ការយល់ឃើញ​របស់​ខ្លួន​ថា "
                    "យុវជន​ខ្មែរ​ហាក់ដូចជា​មានគំនិត​ចង់​បង្កើត​អាជីវកម្ម និង​ធ្វើការ​ឱ្យ​ខ្លួនឯង​ច្រើនជាង​មុន។\n\n\n\nក្រៅពី​ជួយ​ឱ្យ​សេដ្ឋកិច្ច​មានការ​រីកចម្រើន ការចូលរួម​របស់​យុវជន​ដើរតួ​នាទី​យ៉ាង​សំខាន់ណាស់ នៅក្នុង​អាជីវកម្ម​សង្គម ដោយ​ពួក​គេ​អាច​ជួយ​ដល់​ការ​អភិវឌ្ឍ​សង្គម សហគមន៍ បរិស្ថាន បង្កើត​គំនិត​ច្នៃ​ប្រឌិត​ថ្មីៗ "
                    "និង​ធ្វើ​ឱ្យ​មានការ​ផ្លាស់​ប្តូរ​ធំជាង​អ្វី ដែល​យើង​អាច​ស្រមៃ​បាន។\n\n\n\nអ្នកជំនាញ​វ័យក្មេង​រូប​នេះ ក៏បាន​បន្ថែម​ទៀតផង​ដែរ​ថា "
                    "តាម​បទពិសោធន៍​របស់​ខ្លួន ធ្វើការ​ក្នុង​វិស័យ​សហគ្រិនភាព និង​អាជីវកម្ម​នៅ​កម្ពុជា "
                    "ការ​ចាប់ផ្តើម​ធ្វើអាជីវកម្ម​នី​មួយៗអាច​ជួប​បញ្ហា​ប្រឈម ចំនួន​បី​ធំៗរួមមាន ប្រព័ន្ធ​ទ្រទ្រង់ ដែល​ជា​ការ​ផ្តល់​ជំនួយ​ក្នុង​ការគ្រប់គ្រង ត្រួតពិនិត្យ និង​ការ​បង្រៀន​ម្ចាស់​អាជីវកម្ម ឬសហ​គ្រិន​ថ្មីៗក្នុង​ការគ្រប់គ្រង​អាជីវកម្ម​របស់​ខ្លូន ឱ្យ​បាន​ត្រឹមត្រូវ ក៏ដូចជា​ផ្តល់​នូវ​ឱកាស​សម្រាប់​ការបង្កើត​បណ្តាញ​ជាមួយនឹង​ស្ថាប័ន​ដទៃ និង​ជំនួយ​គាំទ្រ​ផ្នែក​ហិរញ្ញវត្ថុ។\n\n\n\nចំនុច​ទីពីរ​គឺ ក្រុមការងារ "
                    "ដែល​ជា​ចំណុច​មួយ​យ៉ាង​សំខាន់ ក្នុង​ការ​ធ្វើ​ឱ្យ​អាជីវកម្ម​ទទួល​បាន​ជោគជ័យ។ ប៉ុន្តែ​យុវជន​ភាគច្រើន មានការ​លំបាក​ក្នុង​ការស្វែងរក​ក្រុមការងារ ព្រោះ​ម្នា​ក់ៗមាន​ជំ​នាញ​ផ្សេងៗពីគ្នា ហើយ​ភាគច្រើន​ពួក​គេ​អាច​ជា​បោះបង់ចោល​នូវ​អាជីវកម្ម​របស់​ខ្លួន និង​ធ្វើការងារ​ផ្សេងទៀត​ជំនួស​វិញ​ក៏​មាន។\n\n\n\nចំណុច​ចុងក្រោយ​គឺ បញ្ហា​ក្នុង​ដំណើរ​ចាប់ផ្តើម​ដំបូង។ ភាគច្រើន​នៃ​ការ​វិនិយោគ​ទៅលើ​អ្វីមួយ អ្នក​នឹងអាច​លះបង់​នូវ​ធនធាន ដូចជា ប្រាក់កាស "
                    "និង​ពេលវេលា​ច្រើន ហើយ​មិន​ទទួល​បាន​លទ្ធផលដូចដែល​បាន​គ្រោងទុក។ ទាំងនេះ​គឺជា​ចំណុច​សំខាន់ ដែល​ត្រូវ​ពិចារណា​សំរាប់​អ្នក​រក​សុី​វ័យក្មេង​ទាំងអស់ តើ​ពួក​គេ​បាន​ត្រៀមខ្លួន​ហើយ​ឬនៅ?\n\n\n\nអ្នកជំនាញ​រូប​នេះ លើកទឹកចិត្ត​ឱ្យ​យុវវ័យ ដែល​មានគំនិត​ចង់​សម្រេចចិត្ត​ចាប់​យក​អាជីវកម្ម ឬការ​វិនិយោគ​ទៅលើ​អ្វីមួយ គួរ​ពិចារណា​ទៅលើ​ចំណុច​សំខាន់​ទាំង​បី​ខាងលើ​នេះ។ ជាពិសេស មុននឹង​សម្រេចចិត្ត​វិនិយោគ​ទៅលើ​អ្វី​មួយ​ភ្លាមៗ "
                    "គួរតែ​ធ្វើការ​ថ្លឹងថ្លែង​ឱ្យ​បាន​ច្បាស់លាស់​រវាង​ការ​ធ្វើ​ឱ្យ​អ្នកដទៃ ឬក្រុមហ៊ុន ដោយ​អ្នក​មិន​ចាំបាច់​ព្រួយបារម្ភ​ថា អ្នក​នឹង​មិន​មាន​ប្រាក់ខែ​នៅ​ចុងខែ និង​ការ​ប្រកប​អាជីវកម្ម ឬវិនិយោគ​អ្វីមួយ​ដោយខ្លួនឯង​ដោយមាន​សេរីភាព ប៉ុន្តែ​អ្នក​នឹង​មាន​ទំនួល​ខុសត្រូវ​ធំជាង​មុន ចំពោះ​ការងារ ប្រាក់ចំណូល​ចំណាយ​ប្រចាំខែ សម្រាប់​ខ្លួនឯង រួម​ទាំង​អ្នកដទៃ​ផង​ដែរ​៕\n"
        )
    }
    article_url = "https://focus-cambodia.com/km/article/young-cambodia-and-job-perspective/"
    article = requests.get(article_url)
    article_response = HtmlResponse(url=article.url, body=article.text, encoding="utf-8")
    article = next(focuscambodia_spider.parse_data(article_response))
    assert article["category"] == expected_value["category"]
    assert article["title"] == expected_value["title"]
    assert article["content"] == expected_value["content"]
    assert article["url"] == article_url