""" Test Case for Newsroom """
import requests

from scrapy.http import HtmlResponse

from url_khmer_scraping.jsonl_scraper.spiders.newsroom import NewsroomSpider

NewsroomSpider = NewsroomSpider()


def test_parse_data_newsroom():
    """
    This function is used to test the parse data method of NewsroomSpider.
    This checks to see if the filtering works correctly.
    This test is conducted using live data from the website.

    Note: The filtering mainly focuses on the URL.

    Attribute
    ---------
    article_response:
        live response generated from article url
    archive_response:
        live response generated from newsroom url
    article: dict
        desired output (should be parsed)
    expected_value: dict
        Expected result of the parsed data.
    """
    expected_value = {
        "title": "លោក មី សុវណ្ណៈ បង្ហាញពីបទពិសោធន៍បរាជ័យដើម្បីជាមេរៀនដល់អ្នកចង់ធ្វើអាជីវកម្មវ័យក្មេង",
        "content": ("ក្តីស្រមៃ និងការគិតដដែលៗចង់ក្លាយជាអ្នករកស៊ី ធ្វើ​ឲ្យ​លោក មី សុវណ្ណៈ​ បច្ចុប្បន្ន​ជា​ម្ចាស់ហាង អ៊ីតធី&ឆៀរ បាន​​ចាប់ផ្តើមប្រឡូកក្នុងវិស័យអាជីវកម្ម​​​កាល​ពី​​​ឆ្នាំ២០១៨​មក "
                    "នៅ​ពេល​ដែល​លោក​ទើប​មក​ពីជនបទ និង​​​រៀន​ឆ្នាំទី២។  ជាអ្នក​ខេត្ត​កំពង់​ធំ និង​ជាអតីត​ក្មេងវត្ត​១២ឆ្នាំ​ផង លោក មី សុវណ្ណៈ ដែល​បច្ចុប្បន្ន​មាន​អាយុ​២៦ឆ្នាំ "
                    "បាន​ចែក​រំលែក​​បទ​​ពិសោធន៍​បរាជ័យ និង​កំហុស​យ៉ាង​ក្រាស់​ក្រែល​​ក្នុង​អាជីវកម្ម​ ដែល​លោក​​​​ចាត់​ទុក​ថា​​​ជាមេ​រៀ​ន​ដ៏អស្ចារ្យសម្រាប់អ្នកចង់រកស៊ីទាំងវ័យក្មេងជំនាន់ក្រោយ។​អតីត​​និស្សិត​​"
                    "ផ្នែក​គ្រប់គ្រងធុរកិច្ច ដែល​មាន​​សម្បុរ​ស្រអែម មាឌមាំ រៀបរាប់ប្រាប់ Newsroom Cambodia កាលពីថ្ងៃទី២៩ ខែមីនា ឆ្នាំ២០២១ ថា លោក​បាន​សម្រេច​ចិត្ត​បន្ត​ការសិក្សា​នៅ​រាជធានី​ភ្នំពេញ ​ក្នុងឆ្នាំ២០០៧ "
                    "ដោយក្រុមគ្រូសារជាអ្នកផ្គត់ផ្គង់។ លោក​បន្តថា លោកចា​ប់​ផ្តើម​ដំបូង​ជា​ស្ថាបនិក នគរប៊ុក្ស ជាដៃគូររកស៊ី Pizza និងអាជីវកម្មផ្សេងៗទៀត ដែល​បាន​ធ្វើ​ឲ្យ​លោក​ជួប​ឧបសគ្គ ស្គាល់រសជាតិការងារ និងរឿងរ៉ាវខកបំណងជាច្រើន "
                    "ប៉ុន្តែលោក​ថា វា​ធ្វើ​ឲ្យ​លោក​រឹងមាំ និងហ៊ានដើរដល់ចំណុច​បច្ចុប្បន្ន​។លោក សុវណ្ណៈ បានលើកយកកំហុសធំ៤យ៉ាង ជា​មេរៀន​មក​ចែក​រំលែក ដោយ​លោក​ថា កំហុស​ធំទី១​របស់លោក "
                    "គឺការចាប់ផ្តើមធំពេក ទាំ​ងដែលខ្លួនខ្វះបទពិសោធន៍ និង​មិនមែន​ជា​កូន​អ្នក​មាន​។ លោក​បន្តថា នៅពេលបរាជ័យ ឬក្ស័យធន "
                    "នឹង​ធ្វើ​ឲ្យ​មនុស្ស​​បាក់​ទឹកចិត្ត​លែង​ចង់​រក​ស៊ីអ្វី​ផ្សេងទៀត​។លោក​បន្ថែម​ថា៖ «បើចង់ចាប់ផ្តើមរកស៊ី ត្រូវចាប់ផ្តើមចេញពីតូច តែខ្លឹម មាន​ន័យថា​ប្រើ​ទុន​តិច​ជាង ឬពាក់កណ្តាលនៃលុយសរុបក្នុងការវិនិយោគ ហើយត្រូវទុកលុយមួយចំនួនទៀត សម្រាប់គាំទ្រនៅពេលជួបហានីភ័យ "
                    "ដូច្នេះមុខជំនួញរបស់យើង គឺមិនងាយដួល។ តែ​នៅ​ពេល​​យើង​ចាប់ផ្តើមធំ ហើយយើងមិនមែនជាកូនអ្នកមាន និងគ្មានទុនតម្កល់សម្រាប់​ផ្គត់ផ្គង់​នៅ​​ពេល​​ខ្វះខាត ឬជួបបញ្ហា  "
                    "ហើយនៅពេលខ្លះទៀតលុយ១០០ដុល្លារ​ ក៏អាចធ្វើ​ឱ្យ​អាជីវកម្ម​បិទ​បាន​ដែរ ដោយសារគ្មានលុយបង្វិល ហើយគ្មាននរណាគេឱ្យលុយខ្ចី ដូច្នោះ​ហើយមុ​ខ​ជំនួញរ​បស់យើងងាយនឹងដួ​លបំផុត»។លោកបន្ថែមថា​ "
                    "សម្រាប់​កំហុស​ទី​ពីរ​គឺ​ការចំណាយតាមការនឹកឃើញ ដោយ​គ្មាន​គណនេយ្យ​ភាព ឬគម្រោងក្នុងការចាយលុយច្បាស់លាស់​។លោកពន្យល់ថា៖ «ចេះតែទិញចូលៗដោយពេលខ្លះគ្មានការចាំបាច់ "
                    "និងទិញតាមអារម្មណ៍ ធ្វើឱ្យខាតបង់លុយជាច្រើនកន្លងមក ហើយនៅពេលចាំបាច់ត្រូវការលុយ ក្នុងការអភិវឌ្ឍហាង បែបជាគ្មាន ក៏ជាចំណុចធ្វើឲ្យជំនួញងាយក្ស័យធនê។ "
                    "ដូច្នេះអ្នកជំនួញត្រូវមានផែនការ ឬ​គោល​​ការណ៍ក្នុងការប្រើទុន ថាតើយើងចំណាយទៅ ត្រូវនឹងគោលដៅហាង ឬ​បាន​ផល​អ្វី​មក​វិញដែរ ឬទេ»។លោក​បន្ថែម​ថា ចំណុច​ទី​៣ "
                    "គឺការធ្វើអាជីវកម្មដោយគ្មានគំរូច្បាស់លាស់ គឺធ្វើតាមអារម្មណ៍ តែងតែ​បត់បែនតាមអំពើចិត្ត ដោយគ្មានផ្តោតអ្វីជាសំខាន់។លោក​ពន្យល់​ថា៖ «ការធ្វើអាជីវកម្មសំខាន់ណាស់ គឺគំរូ "
                    "ឬគម្រោងច្បាស់លាស់ ថា​តើ​ផលិត​ផល ឬសេវាកម្មយើងបម្រើដល់អតិថិជនគឺជាអ្វី ហើយវាពិសេសត្រង់ណា ដែល​អាច​ទាក់​ទាញ​អារម្មណ៍រ​បស់អតិថិជន​ចូលមកហាងរបស់យើង ហើយ​សេវាកម្ម​របស់​យើង​អាច​រស់​បាន​ប៉ុន្មាន​ឆ្នាំ»។សម្រាប់​ចំណុច​ទី​៤ លោក​បញ្ជាក់​ថា "
                    "ការ​ចាប់ផ្តើមដោយចំណង់ ឬឆន្ទៈ តែមិន​មើល​កត្តា​ខាងក្រៅ ឬផ្សេងទៀត។ លោកថា ប្រសិន​បើ​​សមត្ថភាពរក​ស៊ី​​ខ្សោយ នឹង​នឹងប្រើលុយជា​ទុនខ្លាំង ប៉ុន្តែ​បើសមត្ថភាព​ខ្លាំង "
                    "នោះ​លុយជារឿងទី២​​។លោក​បញ្ជាក់​ថា៖ «មុននឹងចាប់ផ្តើមអាជីវកម្ម ក៏ត្រូវដឹងថាយើងមានចំណេះដឹង ឬជំនាញខ្លះៗ​ដែរ​ទេ ទាក់ទងនឹងអាជីវកម្មដែលយើងចង់បើក។ តែបើយើងគ្មានទាំងចំណេះដឹង ឬទុនតិច "
                    "ជាមួយអាជីវកម្មរបស់យើង នោះនឹងងាយបរាជ័យបំផុត»។ជាចុងក្រោយលោក សុវណ្ណៈ បានផ្ញើសារសំខាន់ពីរចំណុចដល់​យុវជន​វ័យក្មេង​ដែល​ចង់​ចាប់ផ្តើម​លើ​វិថី​ជំនួញថា៖ «ទី១ "
                    "កុំរំពឹងថាការចាប់ផ្តើមស្រួលពេក គឺយើងត្រូវត្រៀម មាន​ន័យ​ថា​យើង​ត្រូវមានផែនការ និងហ៊ានឈឺចាប់នៅពេលជួបរឿងខកបំណង និងម្យ៉ាង​ទៀត​ការចាប់ផ្តើម​អាជីវកម្មត្រូវមានអ្នកចង្អុលផ្លូវ ព្រោះយើងនៅក្មេង»៕​")
        }


    article_url = "https://newsroomcambodia.com/kh/2021/04/10/mi-sovannak-telling-about-bad-experience-for-young-people-who-want-to-make-business/"
    article = requests.get(article_url)
    article_response = HtmlResponse(url=article.url, body=article.text, encoding="utf-8")


    article = next(NewsroomSpider.parse_data(article_response))
    assert article["title"] == expected_value["title"]
    assert article["content"] == expected_value["content"]
    assert article["url"] == article_url

def test_parse_newsroom():

    category_url = "https://newsroomcambodia.com/category/kh/"
    category = requests.get(category_url)
    category_response = HtmlResponse(url=category.url, body=category.text, encoding="utf-8")
    category_result = NewsroomSpider.parse(category_response)

    """
    testing the parsing category 
    """
    links = []
    for link in category_result:
        links.append(link.url)
    
    """
    Test for pagination
    """
    next_page = category_response.url.split("/")
    if next_page[-1] == "":
        next_page = next_page[:-1]

    if next_page[-1].isdigit():
        next_page[-1] = str(int(next_page[-1]) + 1)
    else:
        next_page.append("page")
        next_page.append("2")

    next_page = "/".join(next_page)

    assert len(links) - 1 == 26
    assert links[26] == next_page
    assert links[26] == "https://newsroomcambodia.com/category/kh/page/2"
