"""Test Case For Healthtime"""
import requests
from scrapy.http import HtmlResponse
from url_khmer_scraping.jsonl_scraper.spiders.healthtime import HealthtimeSpider
from url_khmer_scraping.jsonl_scraper.utils.pagination_handle import PaginationHandle

healthtime_spider = HealthtimeSpider()
pagination_handle = PaginationHandle()

def test_parse_data_healthtime():
    """
    This function is used to test the parse data method of HealthtimeSpider.
    This checks to see if the filtering works correctly.
    This test is conducted using live data from the website.

    Note: The filtering mainly focuses on the URL.

    Attribute
    ---------
    article_response:
        live response generated from article url
    category:
        live response generated from category url
    article_result:
        list of article urls generated from article response
    article: dict
        desired output (should be parsed)
    """
    expected_value = {
        "category": "\n                                    #គន្លឹះសុខភាព\n                                ",
        "title": "ពិបាកគេងមែនទេ? នេះជាគន្លឹះ៤ពីក្រុមហ៊ុន Herbalife ដើម្បីកែសម្រួលការគេងបានយ៉ាងល្អ",
        "content": ("\n                    (ភ្នំពេញ)៖ ក្រុមហ៊ុន Herbalife កម្ពុជា ដែលជាក្រុមហ៊ុនសុខភាព និងសុខុមាលភាព"
                    "លំដាប់ថ្នាក់ពិភពលោក បានរួមគ្នាចែករំលែកពីគន្លឹះ​ ដើម្បីកែសម្រួលការគេងបានយ៉ាងល្អ។ មនុស្សភាគច្រើនស្គាល់ពីវិធី"
                    "ដែលទទួលទានរបបអាហារដែលមានសុខភាពល្អ និងសកម្មភាពរស់នៅអាចជះឥទ្ធិពលដល់សុខភាពរាងកាយរបស់   "
                    "ពួកគេ ប៉ុន្តែការគេងបានត្រឹមត្រូវមិនទទួលបានប្រសិទ្ធិភាពនោះទេ។តាំងពីក្មេងមក ពួកយើងជាច្រើនបានចូល"
                    "គេងយប់ជ្រៅ ដោយសារតាមដានរឿងភាគ ធ្វើការលើគម្រោង ឬត្រៀមសិក្សាដើម្បីប្រឡង ឬនៅយប់ជ្រៅដោយសារអាច"
                    "នៅបាន។ការកែសម្រួលរយៈពេល និងគុណភាពនៃការគេងគឺជាការចាំបាច់ក្នុងការសម្របខ្លួនទៅនឹងតម្រូវការនៃជីវិត។ "
                    "ការគេងមិនលក់ដែលកើតឡើង ដោយសារការផ្លាស់ប្តូរពេលវេលា ការធ្វើដំណើរ និងភាពតានតឹងទូទៅគឺជារឿងធម្មតា"
                    "ទេ ដូច្នេះវាជាការសំខាន់ណាស់ដែលត្រូវដឹងពីរបៀបវិលត្រលប់មកវិញឱ្យបានឆាប់រហ័ស និងសម្រាកឱ្យបានល្អ។ បន្តអាន"
                    "ដើម្បីទទួលបានព័ត៌មានគ្រប់គ្រាន់អំពីសារៈសំខាន់នៃការគេង និងកត្តាដែលអាចធ្វើអោយវាប្រសើរឡើង។  ប៉ុន្តែជា"
                    "ដំបូង ហេតុអ្វីបានជាការគេងសំខាន់ការគេងមានសារៈសំខាន់ព្រោះវា៖• ផ្តល់អត្ថប្រយោជន៍ដល់មុខងារខួរក្បាល រួមទាំង"
                    "ការយល់ដឹង ការផ្តោតអារម្មណ៍ ផលិតភាព និងការអនុវត្ត• អាចដើរតួនាទីក្នុងការរក្សា ឬសម្រកទម្ងន់ ក៏ដូចជាការ"
                    "បង្កើនប្រសិទ្ធភាពនៃកាយសម្បទា• គាំទ្រមុខងារប្រព័ន្ធភាពស៊ាំដែលធ្វើអោយមានសុខភាពល្អ• មានឥទ្ធិពលលើសមត្ថភាពក្នុងការគ្រប់គ្រងអារម្មណ៍១. ទទួលទានរបបអាហារល្អ ដើម្បីអោយគេង​លក់​ស្រួលតើ​អ្នក​ដឹង​ទេ​ថា​អ្វីដែលអ្នកញុំា ​និង​ពេល​ដែល​អ្នក​ញ៉ាំ​អាច​ប៉ះពាល់​ដល់​ដំណេក​របស់​អ្នក​? យកល្អគួរតែជៀសវាងអាហារធ្ងន់ៗមុនពេលចូលគេង មានដូចជាអាហារដែលមានជាតិកាហ្វេអ៊ីន អាល់កុល​ អាស៊ីត ហឹរ ផ្អែម ឬអាហារមាន"
                    "ជាតិខ្លាញ់ខ្ពស់។ជាការពិតណាស់ មនុស្សគ្រប់រូបមានភាពខុសប្លែកគ្នា ប៉ុន្តែការទទួលទានភេសជ្ជៈ ឬអាហារប្រភេទនេះនៅពេលល្ងាច អាចធ្វើអោយមិនស្រួលក្នុងខ្លួន រសាប់រសល់ ខណៈពេលដែលប្រព័ន្ធរំលាយអាហាររបស់ពួកគេដំណើរការដើម្បីធ្វើការ ។ជំនួសមកវិញ "
                    "សូមសាកល្បងវិធីខាងក្រោម ដើម្បីធ្វើឲ្យអ្នកឆាប់ងងុយគេងពេលយប់ ៖• ញ៉ាំអាហារដែលធ្ងន់បំផុតរបស់អ្នកនៅពេល"
                    "អាហារថ្ងៃត្រង់• ប្រកាន់ខ្ជាប់នូវរបបអាហារដែលមានតុល្យភាព និងសម្បូរសារធាតុចិញ្ចឹម• កុមារគួរកំណត់ការទទួលទានជាតិស្ករអោយបានត្រឹមត្រូវ• មនុស្សពេញវ័យគួរឈប់ទទួលទានជាតិកាហ្វេអ៊ីន និងអាល់កុលនៅពេលរសៀល និងពេលល្ងាច ដោយប្តូរវាទៅទទួល"
                    "ទានតែដែលជំនួយដល់  ស្មារតី២. លំហាត់ប្រាណសម្រាប់ការគេងកាន់តែប្រសើរកង្វះលំហាត់ប្រាណក៏អាចរួមចំណែកដល់វដ្តនៃបញ្ហានៃការគេងមិនលក់ផងដែរ។ ចលនាតិចតួច ឬមិនមានសោះអាចបង្កើនភាពតានតឹង ដែលអាចធ្វើឱ្យអ្នកក្រោកនៅពេលយប់។ "
                    "ម្យ៉ាងវិញទៀត អសមត្ថភាព​ក្នុង​ការ​គេង​នោះ​ធ្វើ​ឱ្យ​មាន​ការ​លំបាក​ក្នុង​ការ​ធ្វើ​សកម្មភាព​ដោយ​សារ​តែ​ភាព​នឿយហត់​ពេល​ថ្ងៃ​កើនឡើង។ដោយសារតែមានអត្ថប្រយោជន៍ជាច្រើនដែលទាក់ទងនឹងការធ្វើលំហាត់ប្រាណ សូមព្យាយាមធ្វើចលនារាងកាយរបស់អ្នកជារៀង"
                    "រាល់ថ្ងៃ។ នៅពេលនិយាយអំពីការសម្រាកឱ្យបានប្រសើរជាងមុន ការធ្វើលំហាត់ប្រាណសាមញ្ញ និងកម្រិតមធ្យមដូចជាការដើរ និងយូហ្គា។ ក្មេងៗគួរតែរីករាយនឹងការលេងប្រចាំថ្ងៃ ហើយការដើរយូរជាក្រុមគ្រួសារគ្រាន់តែជាវិធីមួយដែលអ្នកអាចទទួលបានអត្ថប្រយោជន៍នៃ"
                    "ការធ្វើចលនាជាមួយគ្នា។៣. អនុវត្តអនាម័យនៃការគេងឱ្យល្អចង់ដឹងអត់ថាអនាម័យនៃការគេងជាអ្វី? វាមានន័យថាបង្កើតបរិយាកាសមួយ និងប្រកាន់ខ្ជាប់នូវទម្លាប់ដែលជំរុញឱ្យមានការងងុយគេងដែលមានភាពជាប់លាប់បំផុត។ អនាម័យនៃការគេងមាន"
                    "សារៈសំខាន់សម្រាប់មនុស្សគ្រប់គ្នា ប៉ុន្តែកុមារ និងមនុស្សវ័យជំទង់ ទទួលបានអត្ថប្រយោជន៍ច្រើនបំផុត ព្រោះវាធ្វើអោយពួកគេទទួលបានជោគជ័យពេញមួយជីវិត។• កំណត់កាលវិភាគ៖ ព្យាយាមចូលគេង និងក្រោកពីដំណេកក្នុងពេលតែមួយជារៀងរាល់ថ្ងៃ ព្រោះវា"
                    "បង្កើតចង្វាក់នៃការគេងប្រកបដោយប្រសិទ្ធិភាព។• សម្រាកមុនពេលចូលគេង៖ អនុញ្ញាតឱ្យខ្លួនអ្នក និងកូនរបស់អ្នកពី 30 នាទី ទៅ 1 ម៉ោង ដើម្បីចូលរួមក្នុងសកម្មភាពដែលបង្កើតភាពស្ងប់ស្ងាត់មុនពេលចូលគេង (ឧទាហរណ៍ សមាធិ សរសេរកំណត់ហេតុ អាន ឬស្តាប់តន្ត្រីបន្ធូរ"
                    "អារម្មណ៍។ល។)• កន្លែងគេងរបស់អ្នក៖ បរិយាកាសត្រជាក់ ងងឹត និងស្ងាត់ ដែលគ្មានការរំខានពីអេឡិចត្រូនិច គឺល្អបំផុតសម្រាប់ការ"
                    "សម្រាក ហើយបិទទូរសព្ទដៃ និងទូរទស្សន៍។• ជៀសវាងការងងុយគេងពេលថ្ងៃ៖ ប្រសិនបើមិនអាចជៀសបាន សូមបន្តគេងរយៈពេលខ្លី 30នាទី ឬតិចជាងនេះ ដើម្បីកុំឱ្យរំខានដល់ការគេងនៅពេលយប់។ ៤. បង្កើតពេលវេលាសម្រាប់គ្រួសាររបស់អ្នកការបង្កើតទម្លាប់នៃការគេងសម្រាប់អ្នក និងក្រុមគ្រួសាររបស់អ្នកអាចនាំមកនូវសណ្តាប់ធ្នាប់ដែលមានសុខភាពល្អ។ វាបង្កើតទម្លាប់ដែល \"ពេលវេលាគេង\" ត្រូវបាន"
                    "ចែករំលែកពេញមួយគ្រួសារ ដូច្នេះទំនងជាធ្វើឱ្យវាកាន់តែងាយស្រួលសម្រាប់មនុស្សគ្រប់គ្នាក្នុងការងងុយគេង។ វាក៏នឹងធ្វើឱ្យអ្នក និងក្រុមគ្រួសាររបស់អ្នករៀបចំកាលវិភាគដែលដែលត្រឹមត្រូវផងដែរ ហើយត្រូវប្រាកដថាការអនុវត្តថ្មីនៃការគេងនោះ ប្រែវាក្លាយជាទម្លាប់សម្រាប់អ្នក។"
                    "ឧទាហរណ៍ ថា គ្រួសារមួយកំពុងត្រឡប់ពីវិស្សមកាលវិញ ស្របពេលដែលហត់នឿយ និងត្រូវគិតអំពីការត្រលប់ទៅធ្វើការ ឬសាលាវិញនៅថ្ងៃបន្ទាប់ ។ ពួកគេគួរតែចាប់ផ្តើមបង្កើតទម្លាប់នៃការគេង សម្រាប់កាលវិភាគចូលគេងរបស់ពួកគេ ខណៈពេលដែលប្រើគន្លឹះ"
                    "ខាងលើដើម្បីកែសម្រួលយ៉ាងឆាប់រហ័ស។កាលវិភាគនៃការគេងដ៏ល្អគឺជាឧបករណ៍ដ៏មានឥទ្ធិពលសម្រាប់ភាពជោគជ័យ ដូច្នេះសូមប្រើការណែនាំនៅក្នុងអត្ថបទនេះ ដើម្បីជាប្រយោជន៍ដល់អ្នក និងក្រុមគ្រួសាររបស់អ្នក ដើម្បីសុខភាព និងសុខុមាលភាព។ អំពីក្រុមហ៊ុន "
                    "Herbalifeក្រុមហ៊ុន Herbalife (NYSE: HLF) គឺជាក្រុមហ៊ុនសុខភាព និងសុខុមាលភាពឈានមុខគេ និងជាសហគមន៍ដែលកំពុងផ្លាស់ប្តូរជីវិតរបស់មនុស្សជាមួយនឹងផលិតផលអាហារូបត្ថម្ភដ៏អស្ចារ្យ និងជាឱកាសអាជីវកម្មសម្រាប់អ្នកសមាជិកឯករាជ្យ"
                    "របស់ខ្លួនចាប់តាំងពីឆ្នាំ 1980។ ក្រុមហ៊ុនផ្តល់ជូននូវផលិតផលដែលគាំទ្រដោយវិទ្យាសាស្រ្តដល់អ្នកប្រើប្រាស់នៅក្នុងទីផ្សារ"
                    "ជាង90។ តាមរយៈសមាជិកឯករាជ្យដែលផ្តល់ជូននូវការបណ្តុះបណ្តាលមួយទល់មួយ និងផ្តល់ការគាំទ្រសហគមន៍ដោយបំផុសគំនិតឱ្យអតិថិជនប្រកាន់ខ្ជាប់នូវរបៀបរស់នៅដែលមានភាពសកម្ម")
    }

    article_url = "https://www.healthtime.tips/km/library/article/2187"
    article = requests.get(article_url)
    article_response = HtmlResponse(url=article.url, body=article.text, encoding="utf-8")
    article = next(healthtime_spider.parse_data(article_response))
    assert article["category"] == expected_value["category"]
    assert article["title"] == expected_value["title"]
    assert article["content"] == expected_value["content"]
    assert article["url"] == article_url

def test_parse_healthtime():
    """
    Test of `parse` method of the Healthtime spider.
    
    This test checks the following:
    - The title of the article is not empty.
    - The content of the article is not an empty dictionary.
    - The URL of the article is not an empty dictionary.

    Attributes:
    ----------
    category_url (str):
        The URL of the category page to be tested.
    category (Response):
        The HTTP response object for the category URL.
    category_response (HtmlResponse):
        The response object to be passed to the spider's `parse` method.
    category_result (list):
        The result returned by the spider's `parse` method.
    links (list):
        A list of URLs extracted from the category page.
    next_page (str):
        The URL of the next page after pagination.
    """
    category_url = "https://www.healthtime.tips/km/library/articles?page=2"
    category = requests.get(category_url)
    category_response = HtmlResponse(url=category.url, body=category.text, encoding="utf-8")
    category_result = healthtime_spider.parse(category_response)

    """
    testing the parsing category 
    """
    links = []
    for link in category_result:
        links.append(link.url)
    
    """
    Test for pagination
    """
    next_page = pagination_handle.get_next_page_url_with_param(category_response.url)

    assert len(links) - 1 == 12
    assert links[12] == next_page
    assert links[12] == "https://www.healthtime.tips/km/library/articles?page=3"
